#比较各模型MAPE的大小，从而比较预测效果
#目前需要手动输入MAPE
import matplotlib.pyplot as plt
from matplotlib.pylab import mpl
from matplotlib.font_manager import _rebuild
#import matplotlib.ticker as ticker


#设置绘图时的中文显示（需安装黑体字体）
_rebuild()
mpl.rcParams['font.sans-serif']=[u'SimHei']
mpl.rcParams['axes.unicode_minus']=False

#参数1
LSTM=[0.271,0.272,0.289,0.281,0.492,0.401,0.383,0.389,0.371,0.355,0.332,0.233,0.271,0.322,0.228]

#参数10
#LSTM=[0.361,0.211,0.421,0.411,0.412,0.464,0.361,0.404,0.388,0.427,0.414,0.318,0.578,0.377,0.233]

Box=[0.47434418,0.4589525,0.42549894,0.27090478,0.52292298,0.58947884,
            0.56187282,0.47424107,0.8466649,0.36888544,0.99997075,0.21719773,0.6629269,0.6084974,0.28220186]

Box2=[0.14994799,0.09655134,0.11267693,0.15340131,0.365142,0.15681927,
            0.21035284,0.22042529,0.34279182,0.17215001,0.30332641,0.13930891,0.28403509,0.20122538,0.13077689]

SVR=[0.44947945906035724, 0.9287037837375319, 0.5326724270312596, 0.24904874449520498,
            0.7369063147140974, 0.5641362656518663, 1.5932270106243793, 0.5709293092107647,
            1.7244973541777997, 0.18831841540097208, 1.194094601475464, 0.36231743900268465,
            0.718115520824525, 0.600200266680649, 0.0005460884028347359]

x=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]

plt.figure()

plt.plot(x,Box, label=u'博克斯-詹金斯法',color='teal')#缺省x为[0,1,2,3,4,...]

plt.plot(x,Box2, label=u'解决滞后问题的博克斯-詹金斯法',color='lightgreen')

#plt.plot(x,SVR, label=u'SVR',color='orange')

plt.plot(x,LSTM,label=u'LSTM',color='black') 


plt.xticks(x)

plt.xlabel(u'站点编号')
plt.ylabel(u'MAPE')
plt.title(u"无照经营游商-各模型预测结果MAPE对比图")
plt.legend(loc='best')
plt.show()